In [22]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series, DataFrame

In [4]:
obj = pd.Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
# pandas핵심 기능

In [7]:
#1. 재색인

In [12]:
obj1 = pd.Series([4.5, 7.2, -5.3, 3.6])

In [13]:
obj1

0    4.5
1    7.2
2   -5.3
3    3.6
dtype: float64

In [11]:
obj2 = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [14]:
obj2

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [15]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [16]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [17]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])

In [18]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [19]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [20]:
## 하나의 row와 column 삭제하기

In [23]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [24]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [25]:
new_obj = obj.drop('c')

In [26]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [27]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])

In [28]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data1 = np.arange(16).reshape((4,4))

In [32]:
data1

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [34]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [36]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [37]:
obj.drop('c', inplace=True)

In [38]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [39]:
# 색인하기, 선택하기, 거르기

In [40]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])

In [43]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [41]:
obj['b']

1.0

In [42]:
obj[2:4]

c    2.0
d    3.0
dtype: float64